#### `terraform plan` Success for `deployments/`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_iam_role.orbis-oam will be created
+ resource "aws_iam_role" "orbis-oam" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "arn:aws:iam::595072229124:role/elzwhere"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "orbis-oam"
      + path                  = "/"
      + tags                  = {
          + "orbis-service" = "oam"
        }
      + unique_id             = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform Build`, Action: `self2`*